Revit 2026 API

# PrintManager Class

---

The PrintManager object is used to configure the global print settings.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBPrintManager

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PrintManager : APIObject
```
```vb
Public Class PrintManager
	Inherits APIObject
```
```cpp
public ref class PrintManager : public APIObject
```
```fsharp
type PrintManager =
    class
        inherit APIObject
    end
```

The PrintManager type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Collate | Indicates whether to collate of the current print. |
|  | CombinedFile | Indicates whether to combine multiple selected views/sheets into a single file. |
|  | CopyNumber | The copy number. |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |
|  | IsVirtual | The virtual type in Autodesk Revit. |
|  | PaperSizes | Get all print sizes of current printer. |
|  | PaperSources | Get all print sources of current printer. |
|  | PrinterName | The name of the current printer. |
|  | PrintOrderReverse | Indicates whether to reverse the print order of the current print. |
|  | PrintRange | The print range. |
|  | PrintSetup | The PrintSetup which manages the print settings of current document. |
|  | PrintToFile | Indicates whether to print to file. |
|  | PrintToFileName | The file name when printing to file. |
|  | ViewSheetSetting | The ViewSheetSetting which manages the view/sheet set information of current document, and you can change the default view/sheet set for current project. |

|  | Name | Description |
| --- | --- | --- |
|  | Apply | Apply the local print settings to global for all documents. |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SelectNewPrintDriver | Select a new printer. |
|  | SubmitPrint | Print the views and sheets defined in the current local PrintManager settings. |
|  | SubmitPrint(View) | Print a view with the current PrintManager settings. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

Global print settings include PrintToFile, CombinedFile, PrintToFileName, PrintRange, CopyNumber, PrintOrderReverse, Collate. Once PrintManager is acquired from a document, changes of its global print setting properties are not automatically applied toward the global print setting. Should the local setting be used, the user needs to call the Apply method. If the user calls SubmitPrint methods, not only that printing will use the current state of properties of the (local) print manager, but the setting will also be applied to the global settings.

#### Reference

Autodesk.Revit.DB Namespace